# HP・MP・TP固定値再生
# 制作者：TOMO
#
# ※使い方
# アクター・職業・武器・防具・敵キャラ・ステートのメモ欄に
# 「<HP固定再生:100>」または「<MP固定再生:100>」または「<TP固定再生:100>」
# のように書いて入れる

class Game_Battler
  #--------------------------------------------------------------------------
  # ● HP の再生
  #--------------------------------------------------------------------------
  alias tomo_regenerate_value_regenerate_hp regenerate_hp
  def regenerate_hp
    tomo_regenerate_value_regenerate_hp
    self.hp += hrgv
  end
  #--------------------------------------------------------------------------
  # ● MP の再生
  #--------------------------------------------------------------------------
  alias tomo_regenerate_value_regenerate_mp regenerate_mp
  def regenerate_mp
    tomo_regenerate_value_regenerate_mp
    self.mp += mrgv
  end
  #--------------------------------------------------------------------------
  # ● TP の再生
  #--------------------------------------------------------------------------
  alias tomo_regenerate_value_regenerate_tp regenerate_tp
  def regenerate_tp
    tomo_regenerate_value_regenerate_tp
    self.tp += trgv
  end
  #--------------------------------------------------------------------------
  # ● HP固定再生量の取得
  #--------------------------------------------------------------------------
  def hrgv
    feature_objects.inject(0) {|r, ft| r += ft.hrgv }
  end
  #--------------------------------------------------------------------------
  # ● MP固定再生量の取得
  #--------------------------------------------------------------------------
  def mrgv
    feature_objects.inject(0) {|r, ft| r += ft.mrgv }
  end
  #--------------------------------------------------------------------------
  # ● TP固定再生量の取得
  #--------------------------------------------------------------------------
  def trgv
    feature_objects.inject(0) {|r, ft| r += ft.trgv }
  end
end

class RPG::BaseItem
  #--------------------------------------------------------------------------
  # ● HP固定再生
  #--------------------------------------------------------------------------
  def hrgv
    @note.match(/<HP固定再生:(\d+)>/i) ? $1.to_i : 0
  end
  #--------------------------------------------------------------------------
  # ● MP固定再生
  #--------------------------------------------------------------------------
  def mrgv
    @note.match(/<MP固定再生:(\d+)>/i) ? $1.to_i : 0
  end
  #--------------------------------------------------------------------------
  # ● TP固定再生
  #--------------------------------------------------------------------------
  def trgv
    @note.match(/<TP固定再生:(\d+)>/i) ? $1.to_i : 0
  end
end